const privateConfig = {
    /* Quinzsy Family */

    '599218616470339594': {
        channel: '913136335383068722',
        parent: '814203636888240159'
    }
}

const moderConfig = {
    /* Quinzsy Family */

    '599218616470339594': {
        infoChannel: '911126886606839829',
        adminRoles: ['910198143176552469', '599218880224821258', '908056026719330306'],
        muteRole: '758000122113294448'
    },

    /* Winslow Illegals */

    '893012930830950460': {
        infoChannel: '893012931724316682',
        adminRoles: ['894305072203333665', '893012930977738764', '905150916225814549', '893012930931609623', '893012930931609625']
    }
}

 const roleConfig = {
    /* Quinzsy Family */
    '599218616470339594': {
        adminRoles: ['910198143176552469', '599218880224821258'],
        logsChannel: '918776806847447081'
    },
}

const badwords = {
    /* Winslow Illegals */

    '893012930830950460': {
        bad: ["Ебать", "пиздец", "нахуй", "долбаёб", "хуй", "ахуеть", "ебал", "пизда", "бля пизды", "пидорас", "гандон", "уебище", "уебан ", "проебал", "6ля", "6лядь", "6лять", "b3ъeб", "cock", "cunt", "e6aль", "ebal", "eblan", "eбaл", "eбaть", "eбyч", "eбать", "eбёт", "eблантий", "fuck", "fucker", "fucking", "xyёв", "xyй", "xyя", "xуе", "xуй", "xую", "zaeb", "zaebal", "zaebali", "zaebat", "архипиздрит", "ахуел", "бздение", "бздицы", "бздло", "бзднуть", "бздун", "бздунья", "бздюха", "бздюшка", "бздюшко", "бля", "блябу", "блябуду", "бляд", "бляди", "блядина", "блядище", "блядки", "блядовать", "блядство", "блядун", "блядуны", "блядунья", "блядь", "блядюга", "блять", "вафел", "вафлёр", "взъебка", "взьебка", "взьебывать", "въеб", "въебался", "въебенн", "въебусь", "въебывать", "выблядок", "выблядыш", "выеб", "выебать", "выебен", "выебнулся", "выебон", "выебываться", "выпердеть", "высраться", "выссаться", "вьебен", "гавно", "гавнюк", "гавнючка", "гамно", "гнид", "гнида", "гниды", "говенка", "говенный", "говешка", "говназия", "говнецо", "говнище", "говно", "говноед", "говнолинк", "говночист", "говнюк", "говнюха", "говнядина", "говняк", "говняный", "говнять", "гондон", "доебываться", "долбоеб", "долбоёб", "долбоящер", "дрисня", "дрист", "дристануть", "дристать","дристун", "дристуха", "дрочелло", "дрочена", "дрочила", "дрочилка", "дрочистый", "дрочить", "дрочка", "дрочун", "е6ал", "е6ут", "еб твою мать", "ёб твою мать", "ёбaн", "ебaть", "ебyч", "ебало", "ебальник","ебан", "ебанамать", "ебанат", "ебаная", "ёбаная", "ебанический", "ебанный", "ебанныйврот", "ебаное", "ебануть", "ебануться", "ёбаную", "ебаный", "ебанько", "ебарь", "ебат", "ёбат", "ебатория", "ебать", "ебать-копать","ебаться", "ебашить", "ебёна", "ебет", "ебёт", "ебец", "ебик", "ебин", "ебись", "ебическая", "ебки", "ебла", "еблан", "ебливый", "еблище", "ебло", "еблыст", "ебля", "ёбн", "ебнуть", "ебнуться", "ебня", "ебошить","ебская", "ебский", "ебтвоюмать", "ебун", "ебут", "ебуч", "ебуче", "ебучее", "ебучий", "ебучим", "ебущ", "ебырь", "елда", "елдак", "елдачить", "жопа", "жопу", "заговнять", "задрачивать", "задристать", "задрота","зае6", "заё6", "заеб", "заёб", "заеба", "заебал", "заебанец", "заебастая", "заебастый", "заебать", "заебаться", "заебашить", "заебистое", "заёбистое", "заебистые", "заёбистые", "заебистый", "заёбистый", "заебись","заебошить", "заебываться", "залуп", "залупа", "залупаться", "залупить", "залупиться", "замудохаться", "запиздячить", "засерать", "засерун", "засеря", "засирать", "засрун", "захуячить", "заябестая", "злоеб","злоебучая", "злоебучее", "злоебучий", "ибанамат", "ибонех", "изговнять", "изговняться", "изъебнуться", "ипать", "ипаться", "ипаццо", "Какдвапальцаобоссать", "конча", "курва", "курвятник", "лох", "лошарa","лошара", "лошары", "лошок", "лярва", "малафья", "мандавошек", "мандавошка", "мандавошки", "мандей", "мандень", "мандеть", "мандища", "мандой", "манду", "мандюк", "минет", "минетчик", "минетчица", "млять", "мокрощелка", "мокрощёлка","мразь", "мудak", "мудaк", "мудаг", "мудак", "муде", "мудель", "мудеть", "муди", "мудил", "мудила", "мудистый", "мудня", "мудоеб", "мудозвон", "мудоклюй", "на хер", "на хуй", "набздел", "набздеть", "наговнять","надристать", "надрочить", "наебать", "наебет", "наебнуть", "наебнуться", "наебывать", "напиздел", "напиздели", "напиздело", "напиздили", "насрать", "настопиздить", "нахер", "нахрен", "нахуйник", "не ебет","не ебёт", "невротебучий", "невъебенно", "нехира", "нехрен", "Нехуй", "нехуйственно", "ниибацо", "ниипацца", "ниипаццо", "ниипет", "никуя", "нихера", "нихуя", "обдристаться", "обосранец", "обосрать", "обосцать","обосцаться", "обсирать", "объебос", "обьебать обьебос", "однохуйственно", "опездал", "опизде", "опизденивающе", "остоебенить", "остопиздеть", "отмудохать", "отпиздить", "отпиздячить", "отпороть", "отъебись","охуевательский", "охуевать", "охуевающий", "охуел", "охуенно", "охуеньчик", "охуеть", "охуительно", "охуительный", "охуяньчик", "охуячивать", "охуячить", "очкун", "падла", "падонки", "падонок", "паскуда","педерас", "педик", "педрик", "педрила", "педрилло", "педрило", "педрилы", "пездень", "пездит", "пездишь", "пездо", "пездят", "пердануть", "пердеж", "пердение", "пердеть", "пердильник", "перднуть", "пёрднуть", "пердун","пердунец", "пердунина", "пердунья", "пердуха", "пердь", "переёбок", "пернуть", "пёрнуть", "пи3д", "пи3де", "пи3ду", "пиzдец", "пидар", "пидарaс", "пидарас", "пидарасы", "пидары", "пидор", "пидорасы", "пидорка","пидорок", "пидоры", "пидрас", "пизда", "пиздануть", "пиздануться", "пиздарваньчик", "пиздато", "пиздатое", "пиздатый", "пизденка", "пизденыш", "пиздёныш", "пиздеть", "пиздец", "пиздит", "пиздить", "пиздиться","пиздишь", "пиздища", "пиздище", "пиздобол", "пиздоболы", "пиздобратия", "пиздоватая", "пиздоватый", "пиздолиз", "пиздонутые", "пиздорванец", "пиздорванка", "пиздострадатель", "пизду", "пиздуй", "пиздун", "пиздунья","пизды", "пиздюга", "пиздюк", "пиздюлина", "пиздюля", "пиздят", "пиздячить", "писбшки", "писька", "писькострадатель", "писюн", "писюшка", "по хуй", "по хую", "подговнять", "подонки", "подонок", "подъебнуть", "подъебнуться","поебать", "поебень", "поёбываает", "поскуда", "посрать", "потаскуха", "потаскушка", "похер", "похерил", "похерила", "похерили", "похеру", "похрен", "похрену", "похуй", "похуист", "похуистка", "похую", "придурок", "приебаться", "припиздень", "припизднутый", "припиздюлина", "пробзделся", "проблядь", "проеб", "проебанка", "проебать", "промандеть", "промудеть", "пропизделся", "пропиздеть", "пропиздячить", "раздолбай", "разхуячить", "разъеб", "разъеба", "разъебай", "разъебать", "распиздай", "распиздеться", "распиздяй", "распиздяйство", "распроеть", "сволота", "сволочь", "сговнять", "секель", "серун", "серька", "сестроеб", "сикель", "сирать", "сирывать", "спиздел", "спиздеть", "спиздил", "спиздила", "спиздили", "спиздит", "спиздить", "срака", "сраку", "сраный", "сранье", "срать", "срун", "ссака", "ссышь", "стерва", "страхопиздище", "сука", "суки", "суходрочка", "сучара", "сучий", "сучка", "сучко", "сучонок", "сучье", "сцание", "сцать", "сцука", "сцуки", "сцуконах", "сцуль", "сцыха", "сцыш", "лоx", "лox", "лoх", "Сервер со слитым"],
        logChannel: '919168162979803146'
    }
}

const requestConfig = {

    /* Tucson CA */

    '914529586304413716' : {
        tags: [
            '[Prosecutor]',
            '[Court of Appeals]',
            '[District Court]',
            '[Пра-во]',
            '[СтК]',
            '[ЦБ]',
            '[АШ]'
        ],
        rolesByTags: {
            '[Prosecutor]': '914530262644326400',
            '[Court of Appeals]': '914530264254906378',
            '[District Court]': '914530261625102347',
            '[Пра-во]': '914530263369908244',
            '[СтК]': '914530267358715935',
            '[ЦБ]': '914530265001513040',
            '[АШ]': '914530265722929162'
        }
    },

        /* Tucson CA №2 */

        '911695575878082580' : {
        tags: [
                '[Prosecutor]',
                '[Court of Appeals]',
                '[District Court]',
                '[Пра-во]',
                '[СтК]',
                '[ЦБ]',
                '[АШ]'
            ],
        requestChannel: '911715683157549096',
        rolesByTags: {
                '[Prosecutor]': '914530262644326400',
                '[Court of Appeals]': '914530264254906378',
                '[District Court]': '914530261625102347',
                '[Пра-во]': '914530263369908244',
                '[СтК]': '914530267358715935',
                '[ЦБ]': '914530265001513040',
                '[АШ]': '914530265722929162'
        }
    }
}

const supportConfig = {
    /* Quinzsy Family */

    '599218616470339594': {
        channel: '912721516750319646',
        openParent: '912712871287353344',
        closeParent: '912712871287353344',
        message: {
            mainMessage: `**Добро пожаловать в канал поддержки Quinzsy Family!\nНапишите ниже суть вашей проблемы , и вам помогут!**`,
        },
    },

    /* Winslow Illegals */

    '893012930830950460': {
        channel: '920942552356634624',
        openParent: '920943111486701588',
        closeParent: '920942875439661056',
        supportRole: '920368146504900658',
        message: {
            mainMessage: `**Здесь вы можете задать вопрос агентам поддержки касательно правил или поведения на Discord-сервере Winslow Illegals.
            С правилами обращениями к агенту поддержки можете ознакомиться в канале <#893012931724316691>**`,
        }
    },

    /* Quinzsy winslow */

    '919493298618503169': {
        channel: '921074479902388265',
        openParent: '921074497346478160',
        closeParent: '921074511791677490',
        supportRole: '919493418047131670',
        message: {
            mainMessage: `**Добро пожаловать в канал поддержки. Здесь вы можете задавать вопросы касаемо этого Дискорд сервера, мы вам поможем**`,
        }
    }
}

const sugConfig = {
    /* Winslow Illegals */

    '893012930830950460': {
        channel: `922883832603082772`,
        modRoles: [
            "905150916225814549",
            "893012930977738764",
            "893012930977738763"
        ]
    }
}

module.exports = {
    moderConfig,
    privateConfig,
    roleConfig,
    badwords,
    requestConfig,
    supportConfig,
    sugConfig
};